In [1]:
import pandas as pd
import numpy as np

In [3]:
students_performance = pd.read_csv('StudentsPerformance.csv')

In [4]:
students_performance.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [5]:
students_performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [9]:
students_performance.shape

(1000, 8)

In [12]:
students_performance.groupby('gender').aggregate({'math score' : 'mean',
                                                  'reading score' : 'mean',
                                                  'writing score' : 'mean'})

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [17]:
students_performance.iloc[0:5, 2:5]

  parental level of education         lunch test preparation course
0           bachelor's degree      standard                    none
1                some college      standard               completed
2             master's degree      standard                    none
3          associate's degree  free/reduced                    none
4                some college      standard                    none

In [18]:
students_performance.iloc[[0, 1, 5, 10], [2, 5, -1]]

   parental level of education  math score  writing score
0            bachelor's degree          72             74
1                 some college          69             88
5           associate's degree          71             78
10          associate's degree          58             52

In [19]:
students_performance_with_names = students_performance.iloc[[1, 3, 5, 7, 9]]

In [20]:
students_performance_with_names.index = ['Leha', 'Sanya', 'Danya', 'Igor', 'Vlad']

In [21]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Leha,female,group C,some college,standard,completed,69,90,88
Sanya,male,group A,associate's degree,free/reduced,none,47,57,44
Danya,female,group B,associate's degree,standard,none,71,83,78
Igor,male,group B,some college,free/reduced,none,40,43,39
Vlad,female,group B,high school,free/reduced,none,38,60,50

In [22]:
students_performance_with_names.loc[['Leha', 'Igor'], ['gender', 'lunch']]

      gender         lunch
Leha  female      standard
Igor    male  free/reduced

In [23]:
students_performance_with_names.iloc[:, 0]

Leha     female
Sanya      male
Danya    female
Igor       male
Vlad     female
Name: gender, dtype: object

In [24]:
pd.Series([1, 2, 3], index=['Leha', 'Sanya', 'Danya'])

Leha     1
Sanya    2
Danya    3
dtype: int64

In [25]:
series_1 = pd.Series([1, 2, 3], index=['Leha', 'Sanya', 'Danya'])
series_2 = pd.Series([4, 5, 6], index=['Leha', 'Sanya', 'Danya'])

In [26]:
pd.DataFrame({'col_1' : series_1, 'col_2': series_2})

       col_1  col_2
Leha       1      4
Sanya      2      5
Danya      3      6

In [27]:
students_performance_with_names['lunch']

Leha         standard
Sanya    free/reduced
Danya        standard
Igor     free/reduced
Vlad     free/reduced
Name: lunch, dtype: object

In [29]:
students_performance_with_names[['lunch']]

              lunch
Leha       standard
Sanya  free/reduced
Danya      standard
Igor   free/reduced
Vlad   free/reduced